#coding:utf-8
from 英雄册.App.models import User,hreo

data='''
姓名：a黄继光a
性别：b男b
出生——死亡时间：c1931年-1952年c
家乡：e四川省中江县e
生平事迹：
f抗美援朝战争爆发后，黄继光跟随部队来到上甘岭。1952年，上甘岭战役打响。黄继光的部队接到命令，对上甘岭高地进行反击战争。炮火持续不断，在黄继光部队攻下5号阵地之后，双方人员伤亡损失惨重。
特别是黄继光部队，战士和炮弹捉襟见肘。不妙的是，在进行下一个阵地攻击时，敌人隐藏已久的火力点对着黄继光部队发起猛烈的射击。黄继光部队的进攻遭受到了阻碍，这是他挺身而出，亲自去执行爆破敌人阵地的任务。
摧毁了敌人的几个火力点后，又用自己的身躯去独挡敌人仅剩的火力点。在黄继光的英勇献身下，上甘岭战役取得了胜利。
黄继光（1931年1月8日-1952年10月20日），民族英雄。1931年生于四川省中江县，中国人民志愿军第45师135团9连的通讯员。1952年10月20日在朝鲜上甘岭地区597.9高地牺牲，年仅21岁。f
照片：


姓名：a邓小平a
性别：b男b
出生——死亡时间：c1904年-1997年c
家乡：e四川广安e
生平事迹：
f早年赴欧洲勤工俭学，归国后，他全身心地投入党领导的争取民族独立和人民解放的革命斗争。从土地革命、抗日战争到解放战争，先后担任党和军队的许多重要领导职务，为党中央一系列重大战略决策的实施，为新民主主义革命的胜利和新中国的诞生，建立了赫赫功勋，成为中华人民共和国的开国元勋。[1]
邓小平是全党全军全国各族人民公认的享有崇高威望的卓越领导人，伟大的马克思主义者，伟大的无产阶级革命家、政治家、军事家、外交家，久经考验的共产主义战士，中国社会主义改革开放和现代化建设的总设计师，中国特色社会主义道路的开创者，邓小平理论的主要创立者[2]。
他所倡导的“改革开放”及“一国两制”政策理念，改变了20世纪后期的中国，也影响了世界，因此在1978年和1985年，曾两次当选《时代周刊》“年度风云人物”。f
照片：


姓名：a左宗棠a
性别：b男b
出生——死亡时间：c1812年1885年c
家乡：e湖南湘阴e
生平事迹：
f晚清政治家、军事家、民族英雄[2]，洋务派代表人物之一，与曾国藩等人并称“晚清中兴四大名臣”。
左宗棠曾就读于长沙城南书院，二十岁乡试中举，虽此后在会试中屡试不第，但留意农事，遍读群书，钻研舆地、兵法。后由幕友而起，参与平定太平天国运动、兴办洋务运动、镇压捻军，又主持平定陕甘同治回民起事、收复新疆并推动新疆置省，其间他历任闽浙总督、陕甘总督、两江总督，官至东阁大学士、军机大臣，封二等恪靖侯。中法战争时，自请赴福建督师，1885年（光绪十一年）在福州病逝，享年七十四岁。[275]清廷追赠太傅，谥号“文襄”，并入祀昭忠祠、贤良祠。
左宗棠著有《楚军营制》、《朴存阁农书》等，其奏稿、文牍等在晚清辑为《左文襄公全集》，建国后又辑有《左宗棠全集》。f
照片：









姓名：a曾国藩a
性别：b男b
出生——死亡时间：c1811年-1872年c
家乡：e湖南长沙府湘乡县e
生平事迹：
f道光进士，曾任内阁学士，道光末年官至侍郎。善于讲“道德”说“仁义”，对程朱理学推崇备至。太平天国进军湖南时，被任命为帮办团练大臣，在湖南举办团练。后来组建起一支具有正规军规模的地主武装团练——湘军。咸丰四年发布《讨粤匪檄》。[60]率湘军出省作战，为清政府收复失地。为了强化镇压力量，他主张引进西方先进技术，设立安庆内军械所，制造新式枪炮。咸丰十年（1860年）任两江总督、钦差大臣，督办江南军务。[59]次年攻占安庆，奉命统辖苏、皖、赣、浙四省军务。[60]同治三年（1864年）攻陷天京。次年奉命赴北方镇压捻军起义。同治七年（1868年）调任直隶总督。同治九年 （1870年） 在办理天津教案中媚外残民，受舆论谴责，回任两江总督，病死南京。 [59]
曾国藩的崛起，对清王朝的政治、军事、文化、经济等方面都产生了深远的影响。曾国藩为首的汉族地主经世派的崛起，使清封疆大吏由权贵当权变为经世派当权，促使清地方官员中满汉比例的变化。地方督抚力量的强化与离心倾向的加强。[58]他曾鼓吹并推进洋务运动，主张对外坚守“以羁縻为上”；对内修明政事，急求贤才，引进西方的军事和技术。[60]
曾国藩与胡林翼并称“曾胡”，与李鸿章、左宗棠、张之洞并称“晚清中兴四大名臣”。封一等毅勇侯，谥号“文正”，后世称“曾文正”。f
照片：



姓名：a张之洞a
性别：b男b
出生
生平事迹——死亡时间：c1837年-1909年c
家乡：e贵州兴义府（今安龙县）e
f张之洞于咸丰二年（1852年）十六岁时中顺天府解元，同治二年（1863年）二十七岁中进士第三名探花，授翰林院编修，历任教习、侍读、侍讲、内阁学士、山西巡抚、两广总督、湖广总督、军机大臣等职，并多次署理两江总督。[5]八国联军入侵时，张之洞会同两江总督刘坤一与驻上海各国领事议订“东南互保”，并镇压维新派的唐才常等自立军起义，光绪三十四年（1908年），以顾命重臣晋太子太保，次年（1909年）病卒，赠太保，谥文襄。有《张文襄公全集》传世。
张之洞早年是清流派首领，后成为洋务派的主要代表人物。后世将其与曾国藩、李鸿章、左宗棠并称“晚清中兴四大名臣”。政治上，他主张“中学为体，西学为用”。工业上创办汉阳铁厂、大冶铁矿、湖北枪炮厂等。教育方面，他创办了自强学堂（今武汉大学前身）、三江师范学堂（今南京大学、东南大学等校前身）[51]、湖北农务学堂（今华中农业大学前身）[47]、湖北武昌蒙养院、湖北工艺学堂（今武汉理工大学[66]、武汉科技大学[67]等前身）、慈恩学堂（南皮县第一中学）、广雅书院等。f
照片：



姓名：a谭嗣同a
性别：b男b
出生——死亡时间：c1865年-1898年c
家乡：e直隶省顺天府大兴县（今北京市）e
生平事迹：
f中国近代著名政治家、思想家，维新派人士。其所著的《仁学》，是维新派的第一部哲学著作，也是中国近代思想史中的重要著作。
谭嗣同早年曾在家乡湖南倡办时务学堂、南学会等，主办《湘报》，又倡导开矿山、修铁路，宣传变法维新，推行新政。
1898年（光绪二十四年）9月21日，西太后发动政变。慈禧连发谕旨，捉拿维新派。谭嗣同听到政变消息后并不惊慌，置自己的安危于不顾，多方活动，筹谋营救光绪帝。但措手不及，计划均告落空。在这种情况下，他决心以死来殉变法事业，用自己的牺牲去向封建顽固势力作最后一次反抗。他对劝他离开的人说：“各国变法无不从流血而成，今日中国未闻有因变法而流血者，此国之所以不昌也。有之，请自嗣同始。
光绪二十四年（1898年），谭嗣同参加领导戊戌变法，失败后被杀，年仅33岁，为“戊戌六君子”之一。f
照片：







姓名：a李鸿章a
性别：b男b
出生——死亡时间：c1823年-1901年c
家乡：e安徽省合肥市肥东县（今瑶海区）磨店e
生平事迹：
f中国清朝晚期政治家、外交家、军事将领。世人多称“李中堂”，又称“李二先生”[88]“李傅相”[87]“李文忠”。
李鸿章为道光二十七年（1847年）进士，早年随业师曾国藩镇压太平天国运动与捻军起义，并受命组建淮军，因战功擢升至直隶总督，兼北洋通商大臣，累加至文华殿大学士，封一等肃毅伯。期间着手办理洋务，创办了北洋水师。甲午战争失败后，作为特使与日本签订《马关条约》。后被启用为两广总督。光绪二十六年（1900年）八国联军侵华战争爆发后，参与“东南互保”，并北上谈判，次年与庆亲王奕劻代表清政府签订《辛丑条约》。不久即病逝于北京，享年七十九岁。死后获赠太傅，晋一等肃毅侯，谥号“文忠”。其著作收于《李文忠公全集》。f
照片：









姓名：a胡林翼a
性别：b男b
出生——死亡时间：c1812年-1861年c
家乡：e湖南益阳县泉交河e
生平事迹：
f1831年（道光十一年）五月，沅湘大水，益阳受灾严重，饥民流离失所。时在家受学的胡林翼担心饥民无食一变而为乱民，慨然曰“秀才便当以天下为己任”，挺身而出，面见县令，“请按灾区编户口，劝富民出钱粟以赈”。他还提出具体的救灾方案，即令遭灾各处保甲根据贫富情况造户口册，分上、中、下三等，上户不管，中户可减价买米，下户免费给米，限期一个月。为监督保甲，防止其舞弊，胡林翼建议“选本地士绅协同办理，一以镇地方，一以免保甲之欺罔”。鉴于劝捐遭富民抵制，十数日无动静，他愤不可遏，不得不“一出倡之”，首先请岳父家捐出两千两银子以作表率，然后对其他富民苦口婆心劝导，“以至诚感之，以大义责之，以危言动之，以赏劝诱之”，终于使大家踊跃捐款，立致数万金。“已而，散米表食，全活甚众”。当时，胡林翼年仅二十岁。[3]在给爷爷的信中，他详细叙述此事经过，说：“此事出于孙之意，见无一人赞之，但沮之者不下十数人。而孙自以为泰山崩于前而不动，麋鹿奔于左而不顾，亦可谓毅然不移矣。
1861年在武昌咯血死，谥号文忠。有《胡文忠公遗书》等。f
照片：










姓名：a林则徐a
性别：b男b
出生——死亡时间：c1785年-1850年c
家乡：e福建侯官县左营司巷（今福建福州中山路19号）e
生平事迹：
f晚号俟村老人、俟村退叟、七十二峰退叟、瓶泉居士、栎社散人等[54]，福建侯官县人，中国清代后期政治家、文学家、思想家，民族英雄。
林则徐是嘉庆十六年（1811年）进士，历官翰林编修、江苏按察使、东河总督、江苏巡抚、湖广总督等职。道光十九年（1839年），以钦差大臣赴广东禁烟时，派人明察暗访，强迫外国鸦片商人交出鸦片，并将没收鸦片于虎门销毁。该事件被认为是第一次鸦片战争的导火线。战争爆发不久，林则徐被构陷革职，发往新疆戍边。道光二十五年（1845年）重获起用，历任陕甘总督、陕西巡抚、云贵总督等职，加太子太保。道光三十年（1850年），林则徐在奉命镇压拜上帝会起事途中，病逝于潮州普宁。获赠太子太傅，谥号“文忠”。有《林文忠公政书》等作品传世。f
照片：

姓名：a孙中山a
性别：b男b
出生——死亡时间：c1866年-1925年c
家乡：e广东省香山县翠亨村（今中山市南朗镇翠亨村）e
生平事迹：
f伟大的民族英雄、伟大的爱国主义者、中国民主革命的伟大先驱，中华民国和中国国民党的缔造者，三民主义的倡导者，创立了《五权宪法》。他首举彻底反帝反封建的旗帜，“起共和而终两千年封建帝制”。 
孙中山1866年11月12日生于广东省广州府香山县（今中山市）翠亨村。孙中山原在香港学医，并成为西医医师。孙中山目睹中华民族有被西方列强瓜分的危险，决定抛弃“医人生涯”，进行“医国事业”。孙中山早期受郑观应的改良思想影响，后看清了清政府的腐败，决心推翻清王朝，建立民主共和国。
1894年11月24日，孙中山在檀香山创立兴中会。1905年（光绪三十一年）成立中国同盟会。1911年10月10日（宣统三年）新军中的革命党人暗中联络，决定当天晚上起义。辛亥革命后被推举为中华民国临时大总统（任期1912年1月1日——1912年4月1日）。1925年3月12日，孙中山因癌症在北京逝世。1929年6月1日，根据其生前遗愿，葬于南京紫金山中山陵。1940年，国民政府通令全国，尊称其为“中华民国国父”。
孙中山著有《建国方略》、《建国大纲》、《三民主义》等。其著述在逝世后多次被结集出版，有中华书局1986年出版的十一卷本《孙中山全集》，台北1969、1973、1985年出版的《国父全集》等。f
照片：



姓名：a李大钊a
性别：b男b
出生——死亡时间：c1889年-1927年c
家乡：e河北省乐亭县e
生平事迹：
f李大钊同志是中国共产党的主要创始人之一。从1920年初开始，李大钊同志等革命家就商议在中国建立无产阶级政党的问题。1920年3月，李大钊同志在北京大学发起组织马克思学说研究会。同年秋，他领导建立北京的共产党早期组织和北京社会主义青年团，并积极推动建立全国范围的共产党组织。1921年3月，李大钊同志撰文号召全国的共产主义者“急急组织一个团体”，这个团体是“平民的劳动家的政党”，要担负起“中国彻底的大改革”的责任。1921年，中国共产党宣告成立，这是中国近现代史上开天辟地的大事件。李大钊同志为建党所作的重大贡献，使他成为中国共产党的主要创始人之一。
2019年10月27日，纪念李大钊同志诞辰130周年座谈会在北京举行[4]。会议纪念李大钊同志诞辰130周年，回顾神州大地发生的历史性变化，怀念李大钊同志等老一辈革命家为民族独立和人民解放、国家富强和人民幸福建立的不朽功勋。f
照片：















姓名：a鲁迅a
性别：b男b
出生——死亡时间：c1881年-1936年c
家乡：e浙江省绍兴府会稽县(今浙江省绍兴市)e
生平事迹：
f著名文学家、思想家、革命家、教育家[175]、民主战士，新文化运动的重要参与者，中国现代文学的奠基人之一。
早年与厉绥之和钱均夫同赴日本公费留学，于日本仙台医科专门学校肄业。[176]“鲁迅”，1918年发表《狂人日记》时所用的笔名，也是最为广泛的笔名。
鲁迅一生在文学创作、文学批评、思想研究、文学史研究、翻译、美术理论引进、基础科学介绍和古籍校勘与研究等多个领域具有重大贡献。他对于五四运动以后的中国社会思想文化发展具有重大影响，蜚声世界文坛，尤其在韩国、日本思想文化领域有极其重要的地位和影响，被誉为“二十世纪东亚文化地图上占最大领土的作家”。
民国九年（1920年），在北京大学，北京高等师范学校讲授中国小说史，6月，读《共产党宣言》中文译本盛赞译者。9月，发表小说《风波》。[38][39]
民国十二年（1923年）8月，小说集《呐喊》出版；与弟弟周作人分居，迁至西四塔胡同61号居住，分居原因不明。12月，作《娜拉走后怎样》演讲，兼任女师大，世界语学校教师；《中国小说史略》上册出版。[39][40]
民国十三年（1924年）7月，赴西安讲《中国小说的历史变迁》。8月返京。11月，《语丝》周刊出版，鲁迅在首期发表《论雷峰塔的倒掉》，自此鲁迅成为《语丝》作家群的主将之一。
毛泽东曾评价：“鲁迅的方向，就是中华民族新文化的方向。”f
照片：








姓名：a叶挺a
性别：b男b
出生——死亡时间：c1896年-1946年c
家乡：e广东归善县（今惠阳区周田村）e
生平事迹：
f中国人民解放军创始人之一[15]、新四军重要领导者之一，著名军事家、政治家。
所在的国民革命军第四军在北伐中被誉为“铁军”参与指挥南昌起义并出任前敌总指挥，参加广州起义时任起义军工农红军总司令，抗日战争中又出任新四军军长，皖南事变中被国民党扣押，他拒绝蒋介石的威逼利诱，写出了著名的《囚歌》以明志；抗战胜利后，获救出狱后被中国共产党重新接纳为党员。[2]1946年4月8日与夫人李秀文以及秦邦宪、邓发、王若飞等同志在返回延安途中，不幸空难。[17]
1989年11月，经中央军委确定，被冠以“中国人民解放军军事家”的称号。[1]
2009年9月10日，被评为“100位为新中国成立作出突出贡献的英雄模范人物”。f
照片：

















姓名：a张学良a
性别：b男b
出生——死亡时间：c1901年-2001年c
家乡：e辽宁省鞍山市台安县e
生平事迹：
f国民革命军将领，奉系军阀首领张作霖的长子，中国近代著名爱国将领。
1920年毕业于东三省陆军讲武堂，先于奉系军中担任要职，“皇姑屯事件”之后，他继任为东北保安军总司令，拒绝日本人的拉拢，坚持“东北易帜”，为祖国统一和民族团结做出了贡献。后任中华民国陆海空军副司令，陆军一级上将。西安事变后遭蒋介石父子长期软禁。1990年恢复人身自由，1995年起离台侨居美国夏威夷，2001年10月14日病逝于檀香山，享年101岁。
张学良积极主张抗日，反对内战，曾同杨虎城将军一起发动震惊中外的“西安事变”，促成国共二次合作，结成抗日民族统一战线。
2009年张学良被评为100位为新中国成立作出贡献的英雄模范人物之一。f
照片：

















姓名：a毛泽东a
性别：b男b
出生——死亡时间：c1893年-1976年c
家乡：e湖南省长沙府湘潭县韶山冲e
生平事迹：
f中国人民的领袖，伟大的马克思主义者，伟大的无产阶级革命家[23]、战略家、理论家，中国共产党、中国人民解放军和中华人民共和国的主要缔造者和领导人，马克思主义中国化的伟大开拓者，近代以来中国伟大的爱国者和民族英雄，中国共产党第一代中央领导集体的核心，领导中国人民彻底改变自己命运和国家面貌的一代伟人。
长征途中，1935年1月中共中央政治局在贵州召开扩大会议（即遵义会议），确立了以毛泽东为代表的新的中央领导。10月，中共中央和红一方面军到达陕北，结束长征。12月，作《论反对日本帝国主义的策略》的报告，阐明了抗日民族统一战线政策。
1938年10月，在中共扩大的六届六中全会上提出“马克思主义中国化”的指导原则。在抗日战争时期，他发表《论持久战》、《〈共产党人〉发刊词》、《新民主主义论》等重要著作。
抗日战争胜利后，针对蒋介石企图消灭共产党及其武装力量的现实，他提出“针锋相对”的斗争方针。1945年8月赴重庆同蒋介石谈判，表明中国共产党争取国内和平的愿望。f
照片：













姓名：a闻一多a
性别：b男b
出生——死亡时间：c1899年-1946年c
家乡：e湖北浠水县（今属湖北黄冈）e
生平事迹：
f1905年，进入绵葛轩小学读书。1912年，考入北京清华学校乙班。1914年6月，论文《名誉谈》发表。1919年2月，成为《清华学报》编辑。1920年，编成诗集《古瓦集》《真我集》。1923年3月16日，长诗《园内》写定；9月，出版第一本新诗集《红烛》。1924年6月，毕业于科罗拉多大学。1925年1月上旬，参与发起“中华戏剧改进社”；7月，诗《七子之歌》发表；9月，被聘为北京美术专门学校筹备专员。1927年2月，担任武汉国民革命军政治部艺术股长。1928年1月，诗集《死水》出版。1932年8月，任清华大学国文系教授。1936年1月，论文《离骚解诂》发表。1943年，组织十一学会。1945年3月，联名发表昆明文化界《关于挽救当前危局的主张》[17]。1946年7月15日，在悼念李公朴的大会上，斥责国民党暗杀李公朴的罪行，当日下午被国民党特务暗杀逝世[3][4]。
2009年闻一多被评为100位为新中国成立作出贡献的英雄模范人物之一。f
照片：














姓名：a刘胡兰a
性别：b女b
出生——死亡时间：c1932年-1947年c
家乡：e山西省吕梁市文水县e
生平事迹：
f1947年1月12日，国民党阎锡山军和地主武装“复仇自卫队”包围了云周西村，将群众赶到场地上，刘胡兰因叛徒出卖被捕。在敌人威胁面前，她坚贞不屈，大义凛然。敌人问她：“你给八路做过什么工作？”刘胡兰大声说：“我什么都做过！”“你为啥要参加共产党？”“因为共产党为穷人办事。”敌人恼羞成怒：“你小小年纪好嘴硬啊！你就不怕死？”刘胡兰斩钉截铁地回答：“怕死不当共产党！”残忍的敌人为了使她屈服，在她面前将同时被捕的6位革命群众用铡刀杀害。刘胡兰毫无惧色，从容走向铡刀，壮烈牺牲，尚未满15周岁。[4][7]
毛主席知道后非常伤心，专门为刘胡兰题字："生的伟大，死的光荣"。她也是唯一三代领导人均为其题字的英雄。
2009年9月10日被评为100位为新中国成立作出突出贡献的英雄模范人物之一。f
照片：









姓名：a赵一曼a
性别：b女b
出生——死亡时间：c1905年-1936年c
家乡：e宜宾市翠屏区白花镇e
生平事迹：
f1935年11月，在与日军作战中，赵一曼为掩护部队腿部负伤后在昏迷中被俘。日军为了从赵一曼口中获取到有价值的情报，找了一名军医对其腿伤进行了简单治疗后，连夜对其进行了审讯。
在狱中，日本人动用酷刑，她没有吐露任何信息。赵一曼忍着伤痛怒斥日军侵略中国以来的各种的罪行。日军见赵一曼不肯屈服，使用马鞭狠戳其腿部伤口。身负重伤的赵一曼表现出了一个中国人保卫民族的决心，痛得几次昏了过去，仍坚贞不屈说：“我的目的，我的主义，我的信念，就是反满抗日。”没说出一字有关抗联的情况。
1936年8月1日，日军将她押往珠河。8月2日，日军将其绑在大车上，在珠河县城“游街示众”。此时，赵一曼牺牲之前，面对敌人的屠刀，她高呼“打倒日本帝国主义”、“中国共产党万岁”的口号。当赵一曼昂首走到小北门外的草坪中央时，几个军警的枪口对准她。一个日军军官走到赵一曼跟前问：“你还有什么话要讲吗？”赵一曼怒视着，把手中的纸卷递过去说：“把这些话传给我家乡的儿子！”日军官看过字条，向军警们猛一挥手，罪恶的子弹射进赵一曼的躯体，牺牲于珠河县（今黑龙江省尚志县）小北门外，年仅31岁。f
照片：





姓名：a康有为a
性别：b男b
出生——死亡时间：c1858年-1927年c
家乡：e广东省广州府南海县丹灶苏村e
生平事迹：
f康有为出生于封建官僚家庭，光绪五年（1879年）开始接触西方文化。光绪十四年（1888年），康有为再一次到北京参加顺天乡试，借机第一次上书光绪帝请求变法，受阻未上达。光绪十七年（1891年）后在广州设立万木草堂，收徒讲学。光绪二十一年（1895年）得知《马关条约》签订，联合1300多名举人上万言书，即“公车上书”。光绪二十四年（1898年）开始进行戊戌变法，变法失败后逃往日本，自称持有皇帝的衣带诏，组织保皇会，鼓吹开明专制，反对革命。辛亥革命后，作为保皇党领袖，他反对共和制，一直谋划溥仪复位。民国六年（1917年），康有为和张勋发动复辟，拥立溥仪登基，不久即在当时北洋政府总理段祺瑞的讨伐下宣告失败。康有为晚年始终宣称忠于清朝，溥仪被冯玉祥逐出紫禁城后，他曾亲往天津，到溥仪居住的静园觐见探望。民国十六年（1927年）病逝于青岛。
康有为作为晚清社会的活跃分子，在倡导维新运动时，体现了历史前进的方向。但后来，他与袁世凯成为复辟运动的精神领袖。f
照片：












姓名：a梁启超a
性别：b男b
出生——死亡时间：c1873年-1929年c
家乡：e广东省广州府新会县熊子乡茶坑村e
生平事迹：
f清朝光绪年间举人，中国近代思想家、政治家、教育家、史学家、文学家，戊戌变法（百日维新）领袖之一、中国近代维新派、新法家代表人物。[1]幼年时从师学习，八岁学为文，九岁能缀千言，17岁中举。后从师于康有为，成为资产阶级改良派的宣传家。维新变法前，与康有为一起联合各省举人发动“公车上书”运动，此后先后领导北京和上海的强学会，又与黄遵宪一起办《时务报》，任长沙时务学堂的主讲，并著《变法通议》为变法做宣传。
戊戌变法失败后，与康有为一起流亡日本，政治思想上逐渐走向保守，但是他是近代文学革命运动的理论倡导者。逃亡日本后，梁启超在《饮冰室合集》《夏威夷游记》中继续推广“诗界革命”，批判了以往那种诗中运用新名词以表新意的做法。在海外推动君主立宪。辛亥革命之后一度入袁世凯政府，担任司法总长；之后对袁世凯称帝、张勋复辟等严词抨击，并加入段祺瑞政府。他倡导新文化运动，支持五四运动。其著作合编为《饮冰室合集》。
1929年1月19日，梁启超在北京协和医院溘然长逝，终年56岁。f
照片：













姓名：a陈独秀a
性别：b男b
出生——死亡时间：c1879年-1942年c
家乡：e安徽安庆怀宁县e
生平事迹：
f新文化运动的倡导者、发起者和主要旗手，“五四运动的总司令”，中国共产党的主要创始人之一和党早期主要领导人。
1920年，在上海建立中国共产党发起组，进行建党活动。1921年7月，在上海举行的中国共产党第一次全国代表大会上，被选为中央局书记。1925年领导五卅运动。在第一次国内革命战争后期，由于党内以陈独秀为代表的右倾思想发展为右倾机会主义错误并在党的领导机关中占了统治地位，党和人民不能组织有效抵抗，使革命遭到失败。[21]1927年，在中共“八七”会议上被撤消总书记职务。其后，他坚持城市为中心的国民会议运动和工人运动，反对农村武装斗争，组织托派组织。1929年11月，被开除出中国共产党。后在上海建立托派组织“无产者社”，出版《无产者》刊物，宣传托派观点。抗战爆发后，拥护国共合作和国民党领导抗日，与托派中央决裂。1938年，被王明、康生诬陷为日本间谍。1942年5月，于四川江津病逝。f
照片：















姓名：a周恩来a
性别：b男b
出生——死亡时间：c1898年-1976年c
家乡：e江苏省淮安市e
生平事迹：
f1921年加入中国共产党，是伟大的马克思主义者，伟大的无产阶级革命家、政治家、军事家、外交家，党和国家主要领导人之一，中国人民解放军主要创建人之一，中华人民共和国的开国元勋，是以毛泽东同志为核心的党的第一代中央领导集体的重要成员。
红军长征途中，在具有深远历史意义的遵义会议上，他旗帜鲜明地支持毛泽东同志的正确主张，为确立毛泽东同志在红军和党中央的领导地位，为在危难中挽救红军、挽救党，发挥了重要作用。西安事变爆发后，在民族危亡的关键时刻，他根据党中央的既定方针，前往西安，在极端复杂而艰难的环境中推动西安事变和平解决，促成了国共合作、团结抗日的新局面。抗日战争中，他代表我们党长期坚持在国民党统治区工作，负责与国民党当局谈判，广泛团结社会各阶层爱国人士，坚持并发展抗日民族统一战线，同国民党顽固派进行了有勇有谋的斗争。抗日战争胜利后，为制止内战，他陪同毛泽东同志赴重庆与国民党进行和平谈判，尔后又率领我党代表团与国民党当局开展了有理有节的政治斗争。解放战争时期，他协助毛泽东同志运筹帷幄，在推动第二条战线的形成、转战陕北、指挥一系列改变中国命运的战略大决战、筹备召开新政协、主持起草《共同纲领》等工作中，作出了卓越贡献。f
照片：


姓名：a朱德a
性别：b男b
出生——死亡时间：c1886年-1976年c
家乡：e四川省仪陇县e
生平事迹：
f伟大的马克思主义者，伟大的无产阶级革命家、政治家、军事家，中国人民解放军的主要缔造者之一，中华人民共和国的开国元勋，是以毛泽东同志为核心的党的第一代中央领导集体的重要成员。[1]
建国初期，兼任中共中央纪律检查委员会书记，为加强执政党的建设，维护党的组织纪律，克服党内各种不良倾向，保持党的优良作风，进行了大量卓有成效的工作。他还多次出国访问、会见外国领导人，增进了中国人民和各国人民的友谊。
在“文化大革命”期间，他曾遭到林彪、江青集团的侮辱和打击，但受到毛泽东的保护。1976年7月6日在北京逝世。主要著作收入《朱德选集》。f
照片：


















姓名：a彭德怀a
性别：b男b
出生——死亡时间：c1898年-1974年c
家乡：e湖南省湘潭县彭家围子e
生平事迹：
f中华人民共和国开国元帅，伟大的无产阶级革命家，军事家，政治家，中国人民解放军创建人和领导人之一。
彭德怀于1928年加入中国共产党，第二次国内革命战争时期历任中国工农红军师长、军长、三军团总指挥、中华苏维埃共和国中央革命军事委员会副主席；长征后期担任过陕甘支队司令员；到达陕北以后，担任过红军前敌总指挥。抗日战争时期，担任八路军副总指挥，中共中央北方局代理书记。解放战争时期，担任中国人民解放军副总司令、西北野战军(后为第一野战军)司令员兼政治委员。[1][3]新中国成立后，任中央人民政府委员、人民革命军事委员会副主席、西北军政委员会主席、中共中央西北局第一书记、西北军区司令员。1950年10月，出任中国人民志愿军司令员兼政治委员。1954年后任国务院副总理兼国防部长、国防委员会副主席，对中国人民解放军的现代化、正规化建设，作出了卓越的贡献。1955年被授予中华人民共和国元帅军衔。1956年在中共八届一中全会上，当选为中共中央政治局委员。
“文化大革命”期间，遭到林彪、江青反革命集团的诬陷和残酷迫害，多次被游斗。1974年11月29日逝世。1978年中共十一届三中全会为他平反昭雪，恢复了名誉。f
照片：










姓名：a杨开慧a
性别：b女b
出生——死亡时间：c1901年-1930年c
家乡：e湖南省长沙县板仓e
生平事迹：
f1920年9月，杨开慧串联了福湘、周南两女校的5名女学生，毅然进入岳云男子中学，成为全省男子中学中第一批女学生，在湖南教育界、学界就妇女教育问题展开热烈讨论。
1920年冬，杨开慧加入了中国社会主义青年团，成为湖南第一批团员。就在这时，她和毛泽东在长沙举行了简朴的婚礼，结为革命伴侣。[10]她一不坐花轿，二不要嫁妆，三不用媒妁之言，自由与毛泽东结合，以示“不作俗人之举”。
1921年夏，毛泽东同何叔衡一起，赴上海参加中国共产党第一次全国代表大会。10月10日，中国共产党湖南支部成立，毛泽东任书记。根据中共一大精神，中共湖南支部建立中国劳动组合书记部湖南分部，作为中共领导工人运动的公开机关，毛泽东兼主任。这一年，杨开慧加入了中国共产党。
1922年，毛泽东建立了中共湘区委员会，任区委书记，杨开慧负责党委的机要和交通联络工作，成了毛泽东的得力助手。他们把家安在了长沙市小吴门外的清水塘22号，这也是区委所在地。她经常往来于文化书社、船山学社等党的秘密联络点，传送党的文件和指示，收集工运动态和秘密情报。她经常接待各地来访的工人代表，热情向他们宣传党的主张。同时照料毛泽东的生活起居，使他有精力从事日益繁重的革命工作，杨开慧当时把她母亲也接来跟着住在一起。f
照片：







姓名：a罗亦农a
性别：b男b
出生——死亡时间：c1902年-1928年c
家乡：e湖南湘潭e
生平事迹：
f是中国无产阶级革命家，他曾领导过上海工人第三次武装起义，是中国共产党早期重要领导人之一。
1927年6月，在中共第五次全国代表大会上当选为中央委员，大革命失败后，调任湖北省委书记。在党的“八七”会议上，被选为临时中央政治局委员。会后，主持制定了详细的“鄂南暴动计划”，燃起了工农武装暴动的烈火。同年9月，中共中央迁往上海后，被任命为中共中央长江局书记，负责领导湖北、湖南、江西、四川、安徽、陕西等省的革命党务工作。[12]
1927年11月，在中央政治局扩大会议上，被补选为中共中央政治局委员，常务委员，与周恩来、李维汉组成中央组织局，罗亦农出任主任，并兼任中央组织部部长。年底，离开武汉前往上海中央所在地工作。为筹备召开党的“六大”，负责起草了《党务问题》的报告，并与瞿秋白一起拟写《党纲草案》。
2009年，罗亦农被中央宣传部、中央组织部等11个部门评为“100位为新中国成立作出突出贡献的英雄模范人物”。f
照片：








姓名：a李公朴a
性别：b男b
出生——死亡时间：c1902年-1946年c
家乡：e江苏常州e
生平事迹：
f归国后，他与高士其在南京筹办《环球通讯社》，与邹韬奋、胡愈之等发起筹办《生活日报》，创办旨在改变店员和青年学生痛苦生活的申报流通图书馆。1936年底，图书馆藏书由两千多册增至三万多册，拥有读者二万多人，其中学生达四千五六百人。1934年李公朴创办《读书生活》半月刊。第一部中译本《资本论》由《读书生活》出版社出版。1935年12月，上海各界救国联合会成立，他被选为常务委员。1936年11月23日“七君子”事件发生后，35岁的李公朴在庭审中据理力争。宋庆龄、何香凝等发动爱国入狱运动，中外电报声援纷至沓来。被羁押8个多月的“七君子”被无罪释放。
他是伟大的爱国主义者，坚定的民主战士，中国民主同盟早期领导人，杰出的社会教育家。1946年7月11日在昆明市遭国民党特务开枪暗杀，次日凌晨因伤重、流血过多牺牲。f
照片：









姓名：a关向应a
性别：b男b
出生——死亡时间：c1902年-1946年c
家乡：e辽宁省大连市金州区e
生平事迹：
f1924年加入中国社会主义青年团，第二年加入中国共产党。先后在中共河南省委和共青团中央组织部工作。在中国共产党第六次全国代表大会上被选为中央委员，会后任中国共产主义青年团中央书记。后从事中国工农红军军事委员会及中共中央长江局工作。1932年到湘鄂西革命根据地任湘鄂西军委主席和红三军政治委员。长征途中，任第二方面军副政治委员，曾坚决抵制张国焘另立中央，分裂红军的错误行为。1937年任八路军第一二〇师政治委员，与贺龙一起开辟了晋绥根据地。1946年7月21日病逝于延安。[4]
2009年，关向应被中央宣传部、中央组织部等11个部门评为“100位为新中国成立作出突出贡献的英雄模范人物”。f
照片：







姓名：a刘志丹a
性别：b男b
出生——死亡时间：c1903年-1936年c
家乡：e陕西省保安县（今志丹县）e
生平事迹：
f1935年2月，刘志丹任西北革命军事委员会主席。5月，红26军、中国工农红军第二十七军会合后组成西北革命军事委员会前敌总指挥部，刘志丹任总指挥，率红26军、红27军主力，以围点打援、出敌不意、各个击破的战法，经两个多月的机动作战，攻克延长、延川、安定、安塞、保安、靖边6座县城，歼灭大量敌军，粉碎了国民党军对陕甘边苏区的第二次“围剿”。8月，在陕北、陕甘边苏区第三次反“围剿”中，刘志丹指挥红军主力，歼灭国民党晋军1个团，迫使晋军主力撤回黄河东岸。三次反“围剿”斗争胜利后，陕北、陕甘边两块苏区连成一片，成为中共中央和各路北上抗日红军长征之后的落脚点。9月，红26军、红27军与长征到达陕北的红25军会师，组成红15军团，刘志丹任副军团长兼参谋长。10月参与指挥劳山战役。后在“左”倾路线统治时期的“肃反”中被逮捕，备受折磨，但他始终坚持原则。不久，中共中央到达陕北，毛泽东、周恩来等迅速纠正了陕甘苏区党内“肃反”的错误，刘志丹从而获释。此后任西北革命军事委员会后方办事处副主任、红军北路军总指挥兼第28军军长和中共中央所在地瓦窑堡警备司令等职。f
照片：










姓名：a魏源a
性别：b男b
出生——死亡时间：c1794年-1857年c
家乡：e湖南省邵阳市隆回县e
生平事迹：
f魏源是一个进步的思想家、史学家和坚决反对外国侵略的爱国学者。他积极要求清政府进行改革，强调：“天下无数百年不弊之法，无穷极不变之法，无不除弊而能兴利之法，无不易简而能变通之法。”他着重于经济领域的改革，在鸦片战争前后提出了一些改革水利、漕运、盐政的方案和措施，要求革除弊端以有利于“国计民生”，认为“变古愈尽，便民愈甚”。这些主张不仅在当时具有进步意义，对于后来的资产阶级变法维新运动起了积极的推动作用。
魏源坚决反对西方资本主义的侵华活动，提出了反侵略的主张与办法。他对人民群众的力量有一定的认识，同林则徐“民心可用”的观点相一致，提出“义民可用”的主张。他从三元里和台湾等地人民抗英斗争中得到鼓舞。在三元里人民痛击英国侵略者之后，他满怀激情地以“同仇敌忾士心齐，呼市俄闻十万师”，“前时但说民通寇，此日翻看吏纵夷”的诗句，热情讴歌三元里人民的抗英斗争，愤怒声讨投降派为侵略军解围的可耻行经，并在《海国图志》中写道：“三元里之战，以区区义兵，围夷酋，斩夷师，歼夷兵，以欵开网之而逸，孰谓我兵陆战之不如夷者？”又说“广东之斩夷首，捐舰者皆义民”，“两禽夷舶于台湾，火攻夷船于南澳者亦义民”。他主张利用和依靠人民群众作为抵抗外来侵略的主要力量，与投降派“防民甚于防寇”的反动政策形成鲜明的对照。f
照片：










姓名：a洪秀全a
性别：b男b
出生——死亡时间：c1814年-1864年c
家乡：e广东花县（今广东省广州市花都区）e
生平事迹：
f道光年间，撰写《原道救世歌》等作品。咸丰元年（1851年）1月11日，洪秀全领导发动金田起义，[5]就任天王，定国号太平天国。咸丰三年（1853年），定都江宁（今南京），改称天京。建都之后，洪秀全分兵占领长江各省，派兵北伐、西征[2][6]，并摧毁江南、江北大营。咸丰六年（1856年），洪秀全诛杨秀清、韦昌辉，史称“天京事变”，随后，他迅速启用陈玉成、李秀成等新将领；并以洪仁玕为军师，推行新政。[6]同治三年（1864年）6月1日，洪秀全在天京病逝，享年51岁。其逝世后太平天国运动在中外反动势力的联合绞杀下失败。
在政治上，洪秀全完善职官制度，修建王府，确立五军主将；在经济上，颁布《天朝田亩制度》，力求废除封建土地所有制；在文化上，他改革科举制度[7]，废除“四书五经”[7]；在宗教上，他维护拜上帝教的独立性[8][9]，抵制列强的宗教渗透[8][9]；在主权原则上，对清政府签订的不平等条约一概不予承认，并积极抗击帝国主义侵略。f
照片：









姓名：a徐世昌a
性别：b男b
出生——死亡时间：c1855年-1939年c
家乡：e河南卫辉府e
生平事迹：
f徐世昌早年中举人，后中进士。自袁世凯小站练兵时就为袁世凯的谋士，并为盟友，互为同道；光绪三十一年（1905年）曾任军机大臣。徐世昌颇得袁世凯的器重，在袁世凯称帝时以沉默远离之。民国五年（1916年）3月袁世凯被迫取消帝制，起用他为国务卿。民国七年（1918年）10月，徐世昌被国会选为民国大总统。他下令对南方停战，次年召开议和会议。民国十一年（1922年）6月通电辞职，退隐天津租界以书画自娱。
徐世昌国学功底深厚，不但著书立言，而且研习书法。工山水，颇清秀。书宗苏轼，略变其体。能诗，设晚晴簃诗社，罗致诗友，编印清诗汇。有归云楼题画诗集，成于1924年。[16]一生编书、刻书30余种，如《清儒学案》《退耕堂集》《水竹村人集》等。著作有《欧战后之中国》《退耕堂政书》《大清琨辅先哲传》《书髓楼藏书目》《东三省政略》等书。[16]被后人称为“文治总统”。
民国二十八年（1939年）6月6日，徐世昌病故，年85岁，先寄葬于天津桃园村原英国公墓，后同夫人一起归葬于河南省辉县市百泉镇苏门山下。f
照片：














'''
a=data.split('a')
e=data.split('e')
f=data.split('f')
c=data.split('c')
b=data.split('b')

name=a[1::2]
sex=b[1::2]
bir=c[1::2]
ass=e[1::2]
sto=f[1::2]

for i in range(0, 32):
    register = hreo()
    register.name = name[i]
    register.sex = sex[i]
    register.bir = bir[i]
    register.ass = ass[i]
    register.sto = sto[i]
    register.save()
